const questionTitles = {
  q1: "Ικανοποίηση – Εμπειρία – Αποδοχή",
  q2: "Κατανόηση των Πληροφοριών και Εμπιστοσύνη",
  q3: "Ικανότητα Χρήσης της Εφαρμογής – Προσβασιμότητα",
  q4: "Τεχνολογική Υποδομή",
  q5: "Ψηφιακός Αλφαβητισμός",
  q6: "Επικοινωνία",
  q7: "Πρόσβαση στην Φροντίδα για Ασθενείς, Οικογένεια και / ή Φροντιστές",
  q8: "Εμπειρία των Μελών της Ομάδας Φροντίδας",
  q9: "Ηθικές Αρχές - Προώθηση και Μάρκετινγκ",
  q10: "Ετοιμότητα Εργατικού Δυναμικού",
  q11: "Διαγνωστική Ακρίβεια",
  q12: "Επιπτώσεις στη Θνησιμότητα, στη Νοσηρότητα, στην HRQoL, καθώς και στις Συνήθειες - Συμπεριφορές",
  q13: "Χρήση Υπηρεσιών Υγείας",
  q14: "Λειτουργική Ακεραιότητα και Ακεραιότητα Υποδομών",
  q15: "Ψυχολογική και Συναισθηματική Ασφάλεια",
  q16: "Διακυβέρνηση"
};

const answerTexts = {
    q1: {
      "1": "Δεν υπάρχει καμία καθοδήγηση ή μηχανισμός.",
      "2": "Υπάρχει σαφής καθοδήγηση από τον οργανισμό σχετικά με την εμπειρία των ασθενών από τις υπηρεσίες τηλεϊατρικής, καθώς και ενημέρωση των ασθενών για τις υπηρεσίες υγείας.",
      "3": "Η καθοδήγηση από τον οργανισμό και η ενημέρωση των ασθενών είναι εναρμονισμένες με την εθνική καθοδήγηση ή υπάρχει σχετική έκθεση στον οργανισμό, η οποία αφορά ειδικά τις υπηρεσίες τηλε-υγείας.",
      "4": "Υπάρχουν κατευθυντήριες οδηγίες και ένας μηχανισμός για την εφαρμογή της συλλογής εθνικά εγκεκριμένων μετρήσεων σχετικά με την εμπειρία και την αποδοχή των ασθενών.",
      "5": "Ο οργανισμός πληροί όλα τα κριτήρια και διερευνά ή χρησιμοποιεί συστηματικά ψηφιακά εργαλεία για την καταγραφή της εμπειρίας των ασθενών εκτός από άλλες μορφές έρευνας σχετικά με την εμπειρία και την αποδοχή των ασθενών."
    },

    q2: {
      "1": "Παρέχονται λίγες πληροφορίες σχετικά με τις υπηρεσίες τηλε-υγείας, και οι περισσότερες βρίσκονται στο διαδίκτυο.",
      "2": "Πληροφορίες σχετικά με τις υπηρεσίες τηλε-υγείας είναι διαθέσιμες εντός και εκτός διαδικτύου.",
      "3": "Παρέχονται πληροφορίες σχετικά με τις υπηρεσίες τηλε-υγείας και υπάρχει ένας σχετικός μη δομημένος μηχανισμός ανατροφοδότησης.",
      "4": "Παρέχονται πληροφορίες και υπάρχει ένας επιπλέον μηχανισμός που επιτρέπει στον οργανισμό να λαμβάνει στοιχεία σχετικά με την κατανόηση των πληροφοριών αυτών από τους ασθενείς.",
      "5": "Παρέχονται πληροφορίες σχετικά με τις υπηρεσίες τηλε-υγείας, μετράται η κατανόηση των ασθενών και αξιολογούνται τα επίπεδα εμπιστοσύνης στις υπηρεσίες τηλε-υγείας."
    },  
    
    q3: {
      "1": "Δεν υπάρχει καμία καθοδήγηση ή κανένας μηχανισμός.",
      "2": "Υπάρχουν γενικές οδηγίες για την ενημέρωση των ασθενών σχετικά με τις υπηρεσίες υγείας.",
      "3": "Υπάρχουν κατευθυντήριες οδηγίες για τους παρόχους υπηρεσιών τηλε-υγείας και απαίτηση για τη σύναψη συμβάσεων.",
      "4": "Οι μετρικές συλλέγονται σε οργανωτικό επίπεδο με τη χρήση εθνικών υποδείξεων.",
      "5": "Οι οργανωτικοί μηχανισμοί συλλογής δεδομένων για την καταγραφή της εμπειρίας των ασθενών είναι συνδεδεμένοι με εθνικές πλατφόρμες και υπάρχει πλήρης συμμόρφωση με τις εθνικές οδηγίες."
    },    
    
    q4: {
      "1": "Δεν υπάρχει ειδική υποδομή σχετικά με την τηλε-υγεία ή δεν έχει προσδιοριστεί ως τέτοιου είδους υποδομή.",
      "2": "Έχει εκπονηθεί σχέδιο για τον χαρακτηρισμό και την περαιτέρω βελτίωσης της υποδομής.",
      "3": "Οι υποδομές έχουν προσαρμοστεί μερικώς για την υποστήριξη των υπηρεσιών τηλε-υγείας.",
      "4": "Οι υποδομές έχουν προσαρμοστεί σύμφωνα με τις εθνικές και διεθνείς οδηγίες.",
      "5": "Οι υποδομές έχουν προσαρμοστεί σύμφωνα με τις εθνικές και διεθνείς κατευθυντήριες γραμμές, και υπάρχουν λογισμικό και κανόνες που είναι εξειδικευμένοι για ορισμένες υπηρεσίες τηλε-υγείας."
    }, 
    
    q5: {
      "1": "Υπάρχει ένας μηχανισμός για την εκπαίδευση των ασθενών σχετικά με τις υπηρεσίες τηλε-υγείας.",
      "2": "Υπάρχει ένας μηχανισμός για την διασφάλιση της προώθησης του ψηφιακού αλφαβητισμού από τους οργανισμούς.",
      "3": "Έχουν προσδιοριστεί τοπικές διαδικασίες, οι οποίες εξετάζουν το επίπεδο ψηφιακού αλφαβητισμού των χρηστών και τους μηχανισμούς για τη βελτίωσή του.",
      "4": "Οι τοπικές διαδικασίες βασίζονται στις υφιστάμενες εθνικές κατευθυντήριες οδηγίες σχετικά με τον ψηφιακό αλφαβητισμό.",
      "5": "Εκτός από τις τοπικές διαδικασίες και την τήρηση των κατευθυντήριων οδηγιών, ο οργανισμός οφείλει να ευαισθητοποιεί τους επαγγελματίες ως προς το ρόλο τους στη συμβολή τους στον ψηφιακή αλφαβητισμό στον τομέα της υγείας."
    }, 
    
    q6: {
      "1": "Δεν έχει πραγματοποιηθεί καμία ειδική δράση για την επικοινωνία.",
      "2": "Λαμβάνονται υπόψη ορισμένα στοιχεία της γενικής καθοδήγησης σχετικά με την καλή επικοινωνία στην τηλε-υγεία.",
      "3": "Λαμβάνονται υπόψη οι υπάρχουσες οδηγίες, συμπεριλαμβανομένων πτυχών όπως η προσβασιμότητα και η τήρηση των εθνικών ή περιφερειακών οδηγιών.",
      "4": "Η ευαισθητοποίηση των επαγγελματιών υγείας αναφορικά με την ορθή επικοινωνία στην τηλε-υγεία είναι συμπληρωματική της τήρησης των εθνικών κατευθυντήριων γραμμών από τον οργανισμό.",
      "5": "Τηρούνται οι εθνικές κατευθυντήριες γραμμές, εφαρμόζονται εκπαιδευτικές προσπάθειες και αξιολογούνται οι ικανότητες των επαγγελματιών, ώστε να διασφαλίζονται οι καλές επικοινωνιακές δεξιότητες του σχετικού υγειονομικού προσωπικού."
    },   
    
    q7: {
      "1": "Δεν έχει πραγματοποιηθεί καμία ειδική δράση για την επικοινωνία.",
      "2": "Λαμβάνονται υπόψη ορισμένα στοιχεία της γενικής καθοδήγησης σχετικά με την καλή επικοινωνία στην τηλε-υγεία.",
      "3": "Λαμβάνονται υπόψη οι υπάρχουσες κατευθυντήριες οδηγίες, ορισμένες πτυχές όπως η προσβασιμότητα, οι ειδικές διαδικασίες, ακόμη και οι απαιτήσεις της πλατφόρμας τηλε-υγείας, οι οποίες οφείλουν ακολουθούν τις εθνικές/περιφερειακές απαιτήσεις, όταν αυτές υπάρχουν.",
      "4": "Η ευαισθητοποίηση των επαγγελματιών υγείας αναφορικά με την ορθή επικοινωνία στην τηλε-υγεία είναι συμπληρωματική της τήρησης των εθνικών κατευθυντήριων γραμμών από τον οργανισμό.",
      "5": "Τηρούνται εθνικές κατευθυντήριες οδηγίες, γίνονται εκπαιδευτικές προσπάθειες και αξιολογείται η ικανότητα των επαγγελματιών, ώστε να διασφαλιστούν οι καλές επικοινωνιακές δεξιότητες του εργατικού δυναμικού της τηλε-υγείας."
    }, 
    
    q8: {
      "1": "Δεν έχει πραγματοποιηθεί καμία ειδική δράση για την εκπαίδευση και την ανάπτυξη των ικανοτήτων των επαγγελματικών ομάδων.",
      "2": "Προσπάθειες του οργανισμού για την εκπαίδευση των επαγγελματιών σε μια ομάδα σχετικά με την τηλε-υγεία υπάρχουν, αλλά δεν είναι οργανωμένες ή δεν διεξάγονται με συστηματικό τρόπο.",
      "3": "Υπάρχουν δραστηριότητες για την ενίσχυση της εκπαίδευσης και της ανάπτυξης ικανοτήτων των επαγγελματιών σχετικά με την τηλε-υγεία και τον τρόπο παροχής αυτών των υπηρεσιών, ακολουθώντας τις σχετικές εθνικές οδηγίες, όταν αυτό είναι δυνατόν. Υπάρχουν διαδικασίες για την ενσωμάτωση των υπηρεσιών τηλε-υγείας στις οργανωτικές και δια-οργανωτικές ροές εργασίας.",
      "4": "Η ανάπτυξη δυνατοτήτων σχετικά με την τηλε-υγεία και οι προσαρμογές της ροής εργασίας γενικεύονται και εναρμονίζονται σε ολόκληρο τον οργανισμό. Η πρόοδος στην ενίσχυση των γνώσεων, των στάσεων και των δεξιοτήτων του υγειονομικού προσωπικού σχετικά με την τηλε-υγεία και η ικανότητά του να χρησιμοποιείται για να συμβάλει στην παροχή υψηλής ποιότητας υπηρεσιών,αξιολογείται με προκαθορισμένες μετρήσεις.",
      "5": "Ακολουθούνται όλες οι εθνικές κατευθυντήριες γραμμές, αναλαμβάνονται εκπαιδευτικές προσπάθειες, προσαρμόζονται κατάλληλα οι ροές εργασίας και αξιολογείται τακτικά η ικανότητα των επαγγελματιών στην τηλε-υγεία."
    },    
    
    q9: {
      "1": "Δεν υπάρχει καθοδήγηση.",
      "2": "Εφαρμόζεται γενική καθοδήγηση σχετικά με την προώθηση και το μάρκετινγκ.",
      "3": "Ειδική καθοδήγηση για την τηλε-υγεία εφαρμόζεται σε όλες τις υπηρεσίες του οργανισμού.",
      "4": "Ειδική καθοδήγηση για την τηλε-υγεία εφαρμόζεται και υπάρχουν εκπαιδευτικές προσπάθειες που στοχεύουν στην ανήθικη προώθηση και μάρκετινγκ.",
      "5": "Οι κατευθυντήριες γραμμές ακολουθούνται, οι εκπαιδευτικές προσπάθειες είναι ευρέως αποδεκτές και υπάρχει μηχανισμός επαλήθευσης για τον έλεγχο της συμμόρφωσης."
    },  

    q10: {
      "1": "Δεν υπάρχει σχέδιο ανάπτυξης του εργατικού δυναμικού.",
      "2": "Υπάρχει ένα γενικό σχέδιο ανάπτυξης του εργατικού δυναμικού, το οποίο περιλαμβάνει συγκεκριμένες πτυχές που αφορούν την τεχνολογία πληροφοριών και επικοινωνιών, καθώς και την ψηφιακή υγεία.",
      "3": "Υπάρχει σχέδιο ανάπτυξης του εργατικού δυναμικού, το οποίο περιλαμβάνει σαφώς καθορισμένους στόχους και δραστηριότητες που αφορούν την τηλε-υγεία, ακολουθώντας τις υφιστάμενες υπερ-οργανωτικές κατευθυντήριες οδηγίες.",
      "4": "Η κατάρτιση σε θέματα τηλε-υγείας διεξάγεται σε τακτική βάση για όλο το προσωπικό που συμμετέχει στις υπηρεσίες τηλε-υγείας, με ιδιαίτερη έμφαση στην ποιότητα και την αξιοπιστία από την πλευρά των επαγγελματιών υγείας.",
      "5": "Η διασφάλιση της ποιότητας μιας κατάλληλης και προσαρμοσμένης κατάρτισης σε θέματα τηλε-υγείας για τους επαγγελματίες υγείας υπάρχει και ακολουθεί τις εθνικές προδιαγραφές."
    },  
    
    q11: {
      "1": "Δεν πραγματοποιείται καμία μέτρηση της διαγνωστικής ακρίβειας της τηλε-υγείας.",
      "2": "Η διαγνωστική ακρίβεια της τηλε-υγείας αναλύεται σε ερευνητικά ή πιλοτικά πλαίσια.",
      "3": "Παράγονται στοιχεία διασποράς σχετικά με τη διαγνωστική ακρίβεια των υπηρεσιών τηλε-υγείας.",
      "4": "Σχεδόν για όλες τις υπηρεσίες διατίθενται στοιχεία για τη διαγνωστική ακρίβεια.",
      "5": "Συστηματικά στοιχεία σχετικά με τη διαγνωστική ακρίβεια της τηλε-υγείας συλλέγονται τακτικά και ακολουθούν εθνικές ή περιφερειακές κατευθυντήριες οδηγίες."
    }, 
    
    q12: {
      "1": "Δεν πραγματοποιείται μέτρηση των επιπτώσεων της τηλε-υγείας.",
      "2": "Οι επιπτώσεις των υπηρεσιών τηλεϊατρικής μελετώνται περιστασιακά σε ερευνητικά ή πιλοτικά πλαίσια ή με έναν ad-hoc, μη συστηματικό τρόπο.",
      "3": "Στοιχεία για τις επιπτώσεις της τηλε-υγείας συλλέγονται για ορισμένες υπηρεσίες με ακανόνιστο τρόπο, αλλά ακολουθούν τις εθνικές ή τις διεθνείς κατευθυντήριες γραμμές όταν δεν υπάρχουν εθνικές κατευθυντήριες γραμμές.",
      "4": "Στοιχεία λαμβάνονται για τουλαχιστόν το 90% των υπηρεσιών και με καθορισμένο τρόπο σύμφωνα με τις εθνικές οδηγίες.",
      "5": "Στοιχεία συλλέγονται συστηματικά για όλες τις υπηρεσίες, ακολουθούν τις εθνικές ή περιφερειακές οδηγίες, αναλύονται και διαμορφώνεται επίσημα ένα σχέδιο βελτίωσης."
    },   
    
    q13: {
      "1": "Δεν πραγματοποιείται συστηματική μέτρηση της χρήσης των υπηρεσιών.",
      "2": "Ο οργανισμός ακολουθεί την εθνική καθοδήγηση για τη μέτρηση της χρήσης των υπηρεσιών, αλλά δεν παράγονται συγκεκριμένα στατιστικά στοιχεία για τις υπηρεσίες τηλε-υγείας.",
      "3": "Παράγονται μέτρα διασποράς, τα οποία αφορούν τη χρήση υπηρεσιών τηλε-υγείας και σχετίζονται με άλλα πρότυπα χρήσης υπηρεσιών.",
      "4": "Τα στοιχεία σχετικά με τη χρήση των υπηρεσιών τηλε-υγείας προέρχονται από το 90% των υπηρεσιών και σχέτιζονται με άλλα πρότυπα χρήσης υπηρεσιών.",
      "5": "Η συστηματική καταγραφή των επιπτώσεων της παροχής τηλε-υγείας στη χρήση άλλων υπηρεσιών ακολουθεί την εθνική καθοδήγηση και αναφέρεται σε εθνικό επίπεδο."
    },  
   
    q14: {
      "1": "Δεν υπάρχουν κατευθυντήριες οδηγίες.",
      "2": "Υπάρχουν διεθνείς κατευθυντήριες γραμμές για την ασφάλεια στον κυβερνοχώρο και την ασφάλεια των πληροφορίων.",
      "3": "Υπάρχει ειδική καθοδήγηση για τις υπηρεσίες τηλε-υγείας.",
      "4": "Υπάρχει καθοδήγηση και μηχανισμός ειδικά για τις υπηρεσίες τηλε-υγείας.",
      "5": "Υπάρχει καθοδήγηση, μηχανισμός και εκπαίδευση για τους ασθενείς και τους επαγγελματίες υγείας."
    },  
    
    q15: {
      "1": "Δεν υπάρχουν κατευθυντήριες οδηγίες.",
      "2": "Υπάρχουν γενικές κατευθυντήριες γραμμές για την ψυχολογική και συναισθηματική ασφάλεια στην υγειονομική περίθαλψη.",
      "3": "Δημιουργείται εξειδικευμένη πολιτική για την ψυχολογική και συναισθηματική ασφάλεια στον τομέα της τηλε-υγείας.",
      "4": "Υπάρχουν ειδικές κατευθυντήριες γραμμές για την τηλε-υγεία με εκπαιδευτικές δραστηριότητες για τους επαγγελματίες και ένα σύστημα παραπόνων.",
      "5": "Υπάρχουν κατευθυντήριες γραμμές και ένας μηχανισμός για τη διασφάλιση της ψυχολογικής και συναισθηματικής ασφάλειας στις υπηρεσίες τηλε-υγείας."
    },   
    
    q16: {
      "1": "Δεν υπάρχει σύστημα διακυβέρνησης.",
      "2": "Δεν υπάρχει ειδικός συντονιστής τηλε-υγείας και το ρόλο αυτό αναλαμβάνει ένας κλινικός διευθυντής ή ένας διευθυντής πληροφορικής.",
      "3": "Υπάρχει ειδικός συντονιστής τηλε-υγείας.",
      "4": "Υπάρχει ένα ολοκληρωμένο σύστημα διακυβέρνησης της τηλε-υγείας.",
      "5": "Το σύστημα διακυβέρνησης της τηλε-υγείας είναι ώριμο και παρέχεται ειδική κατάρτιση στο προσωπικό σχετικά με αυτό."
    }          
};

