const questionTitles = {
  q1: "Ικανοποίηση – Εμπειρία – Αποδοχή",
  q2: "Κατανόηση των Πληροφοριών και Εμπιστοσύνη",
  q3: "Ικανότητα Χρήσης της Εφαρμογής – Προσβασιμότητα",
  q4: "Τεχνολογική Υποδομή",
  q5: "Ψηφιακός Αλφαβητισμός",
  q6: "Επικοινωνία",
  q7: "Πρόσβαση στην Φροντίδα για Ασθενείς, Οικογένεια και / ή Φροντιστές",
  q8: "Εμπειρία των Μελών της Ομάδας Φροντίδας",
  q9: "Ηθικές Αρχές - Προώθηση και Μάρκετινγκ",
  q10: "Ετοιμότητα Εργατικού Δυναμικού",
  q11: "Διαγνωστική Ακρίβεια",
  q12: "Επιπτώσεις στη Θνησιμότητα, στη Νοσηρότητα, στην HRQoL, καθώς και στις Συνήθειες - Συμπεριφορές",
  q13: "Χρήση Υπηρεσιών Υγείας",
  q14: "Λειτουργική Ακεραιότητα και Ακεραιότητα Υποδομών",
  q15: "Ψυχολογική και Συναισθηματική Ασφάλεια",
  q16: "Διακυβέρνηση"
};

const answerTexts = {
    //εδω θα προσθεσω αυτα που λειπου...
};

for (let i = 1; i <= 16; i++) {
  const qKey = `q${i}`;
  const value = row[qKey]; // π.χ. "3"
  const title = questionTitles[qKey] || qKey;
  const fullAnswer = answerTexts[qKey]?.[value] || value;

  resultsContainer.innerHTML += `
    <li><strong>Ερώτηση:</strong> ${title}<br>
        <strong>Απάντηση:</strong> ${fullAnswer}</li>
  `;
}